In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'A':[2,4,19,20,35], 'B':[1,42,55,61,32], 'C':[11,5,13,66,31]})

In [3]:
df

    A   B   C
0   2   1  11
1   4  42   5
2  19  55  13
3  20  61  66
4  35  32  31

In [4]:
df.rolling(3,min_periods=1).sum()

      A      B      C
0   2.0    1.0   11.0
1   6.0   43.0   16.0
2  25.0   98.0   29.0
3  43.0  158.0   84.0
4  74.0  148.0  110.0